# 1. Дана строка.
# Сначала выведите третий символ этой строки.
# Во второй строке выведите предпоследний символ этой строки.
# В третьей строке выведите первые пять символов этой строки.
# В четвертой строке выведите всю строку, кроме последних двух символов.
# В пятой строке выведите все символы с четными индексами (считая, что индексация начинается с 0, поэтому символы выводятся начиная с первого).
# В шестой строке выведите все символы с нечетными индексами, то есть начиная со второго символа строки.
# В седьмой строке выведите все символы в обратном порядке.
# В восьмой строке выведите все символы строки через один в обратном порядке, начиная с последнего.
# В девятой строке выведите длину данной строки.

s = "Carpe diem!"
print(s)
print("1.", s[2])
print("2.", s[-2])
print("3.", s[:5])
print("4.", s[:-2])
print("5.", s[1::2])
print("6.", s[2::2])
print("7.", s[::-1])
print("8.", s[::-2])
print("8.", len(s))