# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел.
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
print("среднее арифметическое = ", (a + b) / 2)
print("среднее геометрическое = ", (a * b) / 2)

