# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.

a = int(input("Введите первое целое число: "))
b = int(input("Введите второе целое число: "))
print("сумма = ", a + b)
print("разность = ", a - b)
print("произведение = ", a * b)