# Дана длина ребра куба. Найти объем куба и площадь его боковой
# поверхности.

a = int(input("Введите длинну ребра куба: "))

# V=a³ - формула объема куба
print("объем куба = ", a ** 3)

# S=4a² - формула площади поверъности куба
print("площадь куба = ", 4 * a ** 2)