# Создать пустую переменную. Проверить ее на истинность и ложность.
# Объясните полученный результат.
a = []

print(bool(a))