# Дана строка [“hello my friend”, “my name is”, “house”, “cat”, “dog”].
# В новый список добавить элементы, которые содержат пробел.

list = ["hello my friend", "my name is", "house", "cat", "dog"]
s = []
ind = list.index( )
ind.append(s)
print(s)