# Даны два целых числа m и n (m≤n).
# Напишите программу, которая выводит все числа от m до n включительно.
m = int(input("m: "))
n = int(input("n: "))
for i in range(m,n + 1):
    if m<=m:
        print(i)