# Казино. Компьютер генерирует числа от 1 до 10 и от 1 до 2-х соответственно.
# Цифры от одного до 10 отвечают за номера, а от 1 до 2 за цвета(1-красный,2 черный).
# Пользователю дается 5 попыток угадать номер и цвет(Прим. введения с клавиатуры: 3 красный).
# В случае неудачи вывести на экран правильную комбинацию.
import random
x,y = int(input("Введите число от 1 до 10: ")), input("Введите цвет: ")
num = random.randint(1,10)
col = random.randint(1,2)
i = 1
while i.randint(1,10):
    print(i)
    break
    if y == col:
        break
