# Дан список цветов: ‘red’, ‘green’, ‘white’, ‘black’, ‘pink’, ‘yellow’.
# Создайте еще один список и переместите в него 1-ый, 5-ый и 6-ой элементы.

color = ['red', 'green', 'white', 'black', 'pink', 'yellow']
list = []
list.append(color[1])
print(list)